Repository: Nateem/ckanext-datarequests
Catalog: ckanext/datarequests/i18n/*/LC_MESSAGES/ckanext-datarequests.po
Languages: th

source: Data Request ID has not been included
th: รหัสของการร้องขอชุดข้อมูลยังไม่มีการนำเข้า

source: Data Request %s not found in the data base
th: ร้องขอชุดข้อมูล %s ไม่พบในฐานข้อมูล

source: This Data Request is already closed
th: ร้องขอชุดข้อมูล ชุดนี้ได้ปิดไปแล้ว

source: Comment ID has not been included
th: ไม่พบการแสดงความคิดเห็นนี้

source: Comment %s not found in the data base
th: การแสดงความคิดเห็น %s ไม่พบในฐานข้อมูล

source: Title
th: หัวข้อ

source: Title must be a maximum of %d characters long
th: หัวข้อ มีความยาวตัวอักษรสุงสุดที่ %d ตัวอักษร

source: Title cannot be empty
th: หัวข้อ ไม่สามารถเป็นค่าว่าง

source: That title is already in use
th: หัวข้อนี้ถูกใช้แล้ว

source: Description
th: รายละเอียด

source: Description must be a maximum of %d characters long
th: รายละเอียด มีความยาวตัวอักษรสุงสุดที่ %d ตัวอักษร

source: Organization
th: หน่วยงาน

source: Organization is not valid
th: หน่วยงาน ไม่ถูกต้อง

source: Accepted Dataset
th: ได้รับการยอมรับขุดข้อมูล

source: Dataset not found
th: ไม่พบชุดข้อมูล

source: Data Request
th: ร้องขอชุดข้อมูล

source: Data Request not found
th: ไม่พบ ร้องขอชุดข้อมูล

source: Comment
th: ความคิดเห็น

source: Comments must be a minimum of 1 character long
th: ความคิดเห็น มีความยาวตัวอักษรขั้นต่ำ 1 ตัวอักษร

source: Comments must be a maximum of %d characters long
th: ความคิดเห็น มีความยาวตัวอักษรสุงสุดที่ %d ตัวอักษร

source: Newest
th: ใหม่กว่า

source: Oldest
th: เก่ากว่า

source: State
th: สถานะ

source: Organizations
th: หน่วยงาน

source: "page" parameter must be an integer
th: "page" พารามิเตอร์ต้องเป็นจำนวนเต็ม

source: Unauthorized to list Data Request
th: ไม่ได้รับอนุญาตให้ แสดง รายการ ร้องขอชุดข้อมูล

source: Unauthorized to create a Data Request
th: ไม่ได้รับอนุญาตให้ เพิ่ม รายการ ร้องขอชุดข้อมูล

source: Data Request %s not found
th: ไม่พบ %s ในร้องขอชุดข้อมูล

source: You are not authorized to view the Data Request %s
th: คุณไม่ได้รับอนุญาตให้ดู ร้องขอชุดข้อมูล %s

source: You are not authorized to update the Data Request %s
th: คุณไม่ได้รับอนุญาตให้แก้ไข ร้องขอชุดข้อมูล %s

source: Data Request %s has been deleted
th: ร้องขอชุดข้อมูล %s ถูกลบแล้ว

source: You are not authorized to delete the Data Request %s
th: คุณไม่ได้รับอนุญาตให้ลบ ร้องขอชุดข้อมูล %s

source: This data request is already closed
th: ร้องขอชุดข้อมูล นี้ถูกปิดแล้ว

source: You are not authorized to close the Data Request %s
th: คุณไม่ได้รับอนุญาตให้ปิด ร้องขอชุดข้อมูล %s

source: Comment has been published
th: ความคิดเห็นนี้ถูกเผยแพร่

source: Comment has been updated
th: ความคิดเห็นนี้ถูกแก้ไข

source: You are not authorized to %s
th: คุณไม่ได้รับอนุญาต %s

source: You are not authorized to list the comments of the Data Request %s
th: คุณไม่ได้รับอนุญาตแสดงรายการ ร้องขอชุดข้อมูล %s

source: Comment has been deleted
th: ความคิดเห็นถูกลบ

source: Comment %s not found
th: ไม่พบ ความคิดเห็น %s

source: You are not authorized to delete this comment
th: คุณไม่ได้รับอนุญาต ให้ลบ ความคิดเห็นนี้

source: Datasets
th: ชุดข้อมูล

source: Groups
th: กลุ่ม

source: About
th: เกี่ยวกับ

source: Data Request allow users to ask for data that is not published in the platform yet. If you want some specific data and you are not able to find it among all the published datasets, you can create a new data request specifying the data than you want to get.
th: อนุญาตให้ผู้ใช้ขอข้อมูลที่ไม่ได้เผยแพร่ในแพลตฟอร์ม หากคุณต้องการข้อมูลเฉพาะบางอย่างแต่ไม่สามารถค้นหาได้ในบรรดาชุดข้อมูลที่เผยแพร่ทั้งหมด คุณสามารถสร้างคำขอข้อมูลใหม่ได้

source: Close Data Request
th: ปิดการร้องขอชุดข้อมูล

source: Comments
th: ความคิดเห็น

source: Edit Data Request
th: แก้ไข ร้องขอชุดข้อมูล

source: Add Data Request
th: เพิ่ม ร้องขอชุดข้อมูล

source: Search Data Request...
th: ค้นหา ร้องขอชุดข้อมูล

source: Create Data Request
th: สร้าง ร้องขอชุดข้อมูล

source: To create a data request, fill the form and specify a title and a description for your request. Please, be as clear as you can in order to ease the task of accomplishing your request. You can also specify an organization if your data request is closely related with it.
th: หากต้องการสร้างคำ ร้องขอชุดข้อมูล ให้กรอกแบบฟอร์มและระบุชื่อและคำอธิบายสำหรับคำขอของคุณ โปรดระบุให้ชัดเจนที่สุดเพื่อที่จะดำเนินการตามคำขอของคุณสำเร็จได้ง่ายขึ้น คุณยังสามารถระบุองค์กร เพื่อระบุวงการค้นหาให้แคบลง

source: Manage
th: จัดการ

source: Close
th: ปิด

source: Closed
th: ปิดแล้ว

source: Open
th: เปิด

source: Additional Info
th: ข้อมูลเพิ่มเติม

source: Creator
th: ผู้สร้าง

source: None
th: ไม่มี

source: Created
th: สร้างเมื่อ

source: Not closed yet
th: ยังไม่ปิด

source: Accep. Dataset
th: ยอมรับ ชุดข้อมูล

source: Add a new Comment
th: เพิ่มความคิดเห็นใหม่

source: You can use <a href="#markdown" title="Markdown quick reference" data-target="popover" data-content="%(markdown_tooltip)s" data-html="true">Markdown formatting</a> here. You can refer datasets by adding their URL.
th: คุณสามารถใช้ <a href="#markdown" title="Markdown ดูวิธีอย่างรวดเร็ว" data-target="popover" data-content="%(markdown_tooltip)s" data-html="true">Markdown</a>

source: Cancel
th: ยกเลิก

source: Update Comment
th: แก้ไข ความคิดเห็น

source: Add Comment
th: เพิ่ม ความคิดเห็น

source: Are you sure you want to delete this comment?
th: คุณแน่ใจหรือไม่ที่จะลบ ความคิดเห็น นี้?

source: commented
th: แสดงความคิดเห็น

source: Current Discussion
th: การสนทนาปัจจุบัน

source: This data request has not been commented yet
th: คำขอข้อมูลนี้ยังไม่ได้แสดงความคิดเห็น

source: eg. Data Request Name
th: ตัวอย่าง. ชื่อหัวข้อ คำร้องขอชุดข้อมูล

source: eg. Data Request description
th: ตัวอย่าง. รายละเอียด คำร้องขอชุดข้อมูล

source: No organization
th: ไม่มี หน่วยงาน

source: Are you sure you want to delete this data request?
th: คุณแน่ใจหรือไม่ที่จะลบ คำร้องขอชุดข้อมูล นี้ ?

source: Delete
th: ลบ

source: No Data Request found
th: ไม่พบ คำร้องขอชุดข้อมูล

source: No Data Request found with the given criteria
th: ไม่พบ คำร้องขอชุดข้อมูล จากการกรองนี้

source: How about creating one?
th: บอกเกียวกับมาสักอย่าง?

source: Update Data Request
th: แก้ไข คำร้องขอชุดข้อมูล

source: {0} statistics
th: {0} สถิติ

source: dataset
th: Datensatz

source: datasets
th: ชุดข้อมูล

source: organization
th: หน่วยงาน

source: organizations
th: หน่วยงาน

source: group
th: กลุ่ม

source: groups
th: กลุ่ม

source: related item
th: รายการที่เกี่ยวข้อง

source: data request
th: ร้องขอชุดข้อมูล

source: Activity Stream
th: กิจกรรม

source: {number} data request found for "{query}"
th: {number} รายการ คำร้องขอชุดข้อมูล จาก "{query}"

source: No Data Request found for "{query}"
th: ไม่พบรายการ คำร้องขอชุดข้อมูล จาก "{query}"

source: {number} data request found
th: {number} รายการ คำร้องขอชุดข้อมูลที่พบ
